{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:", 
        "__shape__": "(3,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:", 
        "__shape__": "(3,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:", 
        "__shape__": "(3,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:", 
        "__shape__": "(3,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_batchnorm0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:batchnorm0:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 1], [4, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:", 
        "__shape__": "(16, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_conv0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:conv0:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm0:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation0", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv0:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm1_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm1:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation1", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv1_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv1:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv21_stage1__plus0", 
      "attrs": {"__profiler_scope__": "cifarresnetv21:stage1:"}, 
      "inputs": [[23, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm2:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 1], [28, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation2", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv2:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm3_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm3:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation3", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv3_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv3:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv21_stage1__plus1", 
      "attrs": {"__profiler_scope__": "cifarresnetv21:stage1:"}, 
      "inputs": [[40, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm4_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm4_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm4_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm4_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm4_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm4:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation4", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv4_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv4:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm5_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm5_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm5_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm5_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm5_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm5:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 1], [53, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation5", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv5_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv5:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv21_stage1__plus2", 
      "attrs": {"__profiler_scope__": "cifarresnetv21:stage1:"}, 
      "inputs": [[57, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm6_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm6:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation6", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv6_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv6:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm7_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm7_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm7_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm7_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm7_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm7:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 1], [70, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation7", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv7_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv7_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv7:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv21_stage1__plus3", 
      "attrs": {"__profiler_scope__": "cifarresnetv21:stage1:"}, 
      "inputs": [[74, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm8_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm8_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm8_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm8_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm8_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm8:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 1], [79, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation8", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv8_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv8_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv8:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm9_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm9_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm9_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm9_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm9_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm9:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0], [86, 0, 1], [87, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation9", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv9_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv9_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv9:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv21_stage1__plus4", 
      "attrs": {"__profiler_scope__": "cifarresnetv21:stage1:"}, 
      "inputs": [[91, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm10_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm10_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm10_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm10_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm10_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm10:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 1], [96, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation10", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv10_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv10_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv10:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm11_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm11_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm11_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm11_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm11_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm11:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0], [102, 0, 0], [103, 0, 1], [104, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation11", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv11_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv11_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv11:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv21_stage1__plus5", 
      "attrs": {"__profiler_scope__": "cifarresnetv21:stage1:"}, 
      "inputs": [[108, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm12_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm12_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm12_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm12_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm12_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm12:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0], [112, 0, 1], [113, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation12", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv12_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv12_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv12:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm13_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm13_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm13_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm13_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm13_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm13:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0], [119, 0, 0], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation13", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv13_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv13_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv13:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv21_stage1__plus6", 
      "attrs": {"__profiler_scope__": "cifarresnetv21:stage1:"}, 
      "inputs": [[125, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm14_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm14_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm14_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm14_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv21_stage1_batchnorm14_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:batchnorm14:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 1], [130, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv21_stage1_activation14", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_conv14_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv21_stage1_conv14_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv21:stage1:conv14:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm15_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm15_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm15_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv21_stage1_batchnorm15_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv21:stage1:", 
        "__shape__": "(16,)", 
