{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:", 
        "__shape__": "(16, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_conv0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:conv0:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_batchnorm0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:batchnorm0:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage1_conv0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:conv0:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage1_batchnorm0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:batchnorm0:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 1], [13, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage1_relu0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:relu0:", 
        "act_type": "relu"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage1_conv1_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:conv1:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage1_batchnorm1_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:batchnorm1:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 1], [21, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv10_stage1__plus0", 
      "attrs": {"__profiler_scope__": "cifarresnetv10:stage1:"}, 
      "inputs": [[7, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage1_activation0", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage1_conv2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:conv2:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage1_batchnorm2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:batchnorm2:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage1_relu1_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:relu1:", 
        "act_type": "relu"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage1_conv3_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:conv3:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage1_batchnorm3_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:batchnorm3:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv10_stage1__plus1", 
      "attrs": {"__profiler_scope__": "cifarresnetv10:stage1:"}, 
      "inputs": [[24, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage1_activation1", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage1_conv4_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:conv4:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm4_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm4_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm4_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm4_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage1_batchnorm4_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:batchnorm4:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage1_relu2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:relu2:", 
        "act_type": "relu"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage1_conv5_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:conv5:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm5_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm5_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm5_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage1_batchnorm5_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage1_batchnorm5_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:batchnorm5:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv10_stage1__plus2", 
      "attrs": {"__profiler_scope__": "cifarresnetv10:stage1:"}, 
      "inputs": [[41, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage1_activation2", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage1:", 
        "act_type": "relu"
      }, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32, 16, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage2_conv2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:conv2:", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage2_batchnorm2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:batchnorm2:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage2_conv0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:conv0:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[58, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage2_batchnorm0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:batchnorm0:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 1], [71, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage2_relu0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:relu0:", 
        "act_type": "relu"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage2_conv1_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:conv1:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage2_batchnorm1_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:batchnorm1:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 1], [79, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv10_stage2__plus0", 
      "attrs": {"__profiler_scope__": "cifarresnetv10:stage2:"}, 
      "inputs": [[65, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage2_activation0", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "act_type": "relu"
      }, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage2_conv3_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:conv3:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm3_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm3_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage2_batchnorm3_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:batchnorm3:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0], [87, 0, 1], [88, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage2_relu1_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:relu1:", 
        "act_type": "relu"
      }, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage2_conv4_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:conv4:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm4_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm4_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm4_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm4_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage2_batchnorm4_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:batchnorm4:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 1], [96, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv10_stage2__plus1", 
      "attrs": {"__profiler_scope__": "cifarresnetv10:stage2:"}, 
      "inputs": [[82, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage2_activation1", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "act_type": "relu"
      }, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage2_conv5_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:conv5:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm5_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm5_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm5_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm5_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage2_batchnorm5_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:batchnorm5:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0], [104, 0, 1], [105, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage2_relu2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:relu2:", 
        "act_type": "relu"
      }, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_conv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage2_conv6_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:conv6:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm6_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm6_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm6_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage2_batchnorm6_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage2_batchnorm6_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:batchnorm6:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0], [112, 0, 1], [113, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifarresnetv10_stage2__plus2", 
      "attrs": {"__profiler_scope__": "cifarresnetv10:stage2:"}, 
      "inputs": [[99, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage2_activation2", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage2:", 
        "act_type": "relu"
      }, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64, 32, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage3_conv2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage3:conv2:", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage3_batchnorm2_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage3:batchnorm2:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0], [120, 0, 0], [121, 0, 1], [122, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage3_conv0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage3:conv0:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[116, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifarresnetv10_stage3_batchnorm0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage3:batchnorm0:", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0], [127, 0, 0], [128, 0, 1], [129, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifarresnetv10_stage3_relu0_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage3:relu0:", 
        "act_type": "relu"
      }, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifarresnetv10_stage3_conv1_fwd", 
      "attrs": {
        "__profiler_scope__": "cifarresnetv10:stage3:conv1:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "cifarresnetv10:stage3:", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifarresnetv10_stage3_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
